
# -*- coding:utf-8 -*-
#編集環境ををutf-8にする

#######################################################################################
# ProjectName   : テンプレートプログラム
# FileName      : template.py
# Name          : 木村雅椰
# Year,month,day: 2017,02,21
#
#comment        :
#
#######################################################################################

#######################################################################################
# import
#######################################################################################
import smtplib                      #メール送信ライブラリー
from email.MIMEText import MIMEText #
from email.Header import Header     #
from email.Utils import formatdate  #
import sys                          #システムパラメータpackage
#######################################################################################

#######################################################################################
# define
#######################################################################################
#MAX_NUMBER = 5
#######################################################################################

#######################################################################################
# Class
#######################################################################################

#######################################################################################
# GlobalVariable
#######################################################################################


#######################################################################################
# 関数名 : main()
# 返り値 : なし
# 説明　 : main関数
#
#######################################################################################
def main():
    from_address = 'bbb5d2ded79m7m@yahoo.co.jp'       #送信元
    to_address = 'bbb5d2ded79m7m@yahoo.co.jp'         #送信先

    charset = 'ISO-2022-JP' #送信文字コード
    subject = u'メールの件名です'
    text = u'メールの本文です'

    msg = MIMEText(text.encode(charset), 'plain', charset)
    msg['Subject'] = Header(subject, charset)
    msg['From'] = from_address
    msg['To'] = to_address
    msg['Date'] = formatdate(localtime=True)
    
    smtp = smtplib.SMTP("smtp.mail.yahoo.co.jp",25)
    #smtp.connect()
    smtp.ehlo()
    smtp.starttls()
    smtp.ehlo()
    smtp.login('bbb5d2ded79m7m','masayajapan')
    smtp.sendmail(from_address, to_address, msg.as_string())
    smtp.close()

    return 0

#######################################################################################
if __name__ == "__main__":
        sys.exit(main())
